[
  {
    "id": "accessibility",
    "term": "accessibility",
    "status": "Required",
    "usageNotes": "The practice of making products usable by people with disabilities. Always prioritize accessibility in design and development. Use inclusive language and follow WCAG guidelines."
  },
  {
    "id": "user-experience",
    "term": "user experience",
    "status": "Preferred",
    "usageNotes": "The overall experience a person has when interacting with a product or service. Abbreviate as UX when space is limited. Focus on user needs and pain points."
  },
  {
    "id": "dark-pattern",
    "term": "dark pattern",
    "status": "Avoid",
    "usageNotes": "Deceptive UX practices that trick users into unintended actions. Never implement dark patterns. Instead, use transparent and honest design practices that respect user autonomy."
  },
  {
    "id": "responsive-design",
    "term": "responsive design",
    "status": "Required",
    "usageNotes": "Design approach that ensures interfaces work well across different screen sizes and devices. Always implement responsive design principles. Test on multiple devices and screen sizes."
  },
  {
    "id": "wireframe",
    "term": "wireframe",
    "status": "Preferred",
    "usageNotes": "Low-fidelity structural blueprint of a page or screen. Use wireframes in early design phases to focus on layout and functionality before visual design. Keep them simple and avoid detailed styling."
  },
  {
    "id": "pixel-perfect",
    "term": "pixel perfect",
    "status": "Use with caution",
    "usageNotes": "Design implementation that matches the original design exactly down to the pixel level. While attention to detail is important, prioritize user experience and accessibility over pixel-perfect accuracy. Consider responsive behavior and different screen densities."
  },
  {
    "id": "mobile-first",
    "term": "mobile first",
    "status": "Preferred",
    "usageNotes": "Design and development approach that starts with mobile devices and progressively enhances for larger screens. Prioritize mobile experience given the majority of users access content via mobile devices."
  },
  {
    "id": "above-the-fold",
    "term": "above the fold",
    "status": "Use with caution",
    "usageNotes": "Content visible without scrolling on a webpage. This term originates from print newspapers. Use sparingly as screen sizes vary greatly. Focus on progressive disclosure and content hierarchy instead."
  },
  {
    "id": "conversion-rate",
    "term": "conversion rate",
    "status": "Preferred",
    "usageNotes": "Percentage of users who complete a desired action (purchase, signup, etc.). Use to measure the effectiveness of design and content changes. Always define what constitutes a conversion for your specific context."
  },
  {
    "id": "stakeholder",
    "term": "stakeholder",
    "status": "Preferred",
    "usageNotes": "Any person or group with an interest in or influence over a project's outcome. Include stakeholders in design decisions and keep them informed of progress. Identify primary and secondary stakeholders early in projects."
  }
]
